In [1]:
import pandas as pd
students_data = {
    "Student_ID": [101, 102, 103, 104, 105, 106, 107],
    "Name": ["Aman", "Bhavna", "Chirag", "Divya", "Eshan", "Fatima", "Gaurav"],
    "Maths": [87, 78, 90, 66, 92, 81, 74],
    "Science": [82, 69, 85, 70, 89, 76, 80],
    "English": [75, 88, 79, 91, 73, 85, 68],
    "Attendance(%)": [95, 88, 90, 92, 85, 93, 87]
}
data_df=pd.DataFrame(students_data)
data_df

   Student_ID    Name  Maths  Science  English  Attendance(%)
0         101    Aman     87       82       75             95
1         102  Bhavna     78       69       88             88
2         103  Chirag     90       85       79             90
3         104   Divya     66       70       91             92
4         105   Eshan     92       89       73             85
5         106  Fatima     81       76       85             93
6         107  Gaurav     74       80       68             87

In [2]:
data_df1=data_df.groupby(["Name","Maths"])["Science"].sum().reset_index()
data_df1

     Name  Maths  Science
0    Aman     87       82
1  Bhavna     78       69
2  Chirag     90       85
3   Divya     66       70
4   Eshan     92       89
5  Fatima     81       76
6  Gaurav     74       80

In [6]:
data_df1=data_df.groupby(["Name","Maths"])[["Science","English","Student_ID"]].sum().reset_index()
data_df1

     Name  Maths  Science  English  Student_ID
0    Aman     87       82       75         101
1  Bhavna     78       69       88         102
2  Chirag     90       85       79         103
3   Divya     66       70       91         104
4   Eshan     92       89       73         105
5  Fatima     81       76       85         106
6  Gaurav     74       80       68         107

In [7]:
data_df1=data_df.groupby(["Name","Maths"])[["Science","English","Student_ID"]].sum().unstack()
data_df1

       Science                                     English              ...  \
Maths       66    74    78    81    87    90    92      66    74    78  ...
Name                                                                    ...
Aman       NaN   NaN   NaN   NaN  82.0   NaN   NaN     NaN   NaN   NaN  ...
Bhavna     NaN   NaN  69.0   NaN   NaN   NaN   NaN     NaN   NaN  88.0  ...
Chirag     NaN   NaN   NaN   NaN   NaN  85.0   NaN     NaN   NaN   NaN  ...
Divya     70.0   NaN   NaN   NaN   NaN   NaN   NaN    91.0   NaN   NaN  ...
Eshan      NaN   NaN   NaN   NaN   NaN   NaN  89.0     NaN   NaN   NaN  ...
Fatima     NaN   NaN   NaN  76.0   NaN   NaN   NaN     NaN   NaN   NaN  ...
Gaurav     NaN  80.0   NaN   NaN   NaN   NaN   NaN     NaN  68.0   NaN  ...

                         Student_ID
Maths     87    90    92         66     74     78     81     87     90     92
Name
Aman    75.0   NaN   NaN        NaN    NaN    NaN    NaN  101.0    NaN    NaN
Bhavna   NaN   NaN   NaN        NaN    NaN  102.0    NaN    NaN    NaN    NaN
Chirag   NaN  79.0   NaN        NaN    NaN    NaN    NaN    NaN  103.0    NaN
Divya    NaN   NaN   NaN      104.0    NaN    NaN    NaN    NaN    NaN    NaN
Eshan    NaN   NaN  73.0        NaN    NaN    NaN    NaN    NaN    NaN  105.0
Fatima   NaN   NaN   NaN        NaN    NaN    NaN  106.0    NaN    NaN    NaN
Gaurav   NaN   NaN   NaN        NaN  107.0    NaN    NaN    NaN    NaN    NaN

[7 rows x 21 columns]

In [10]:
data_df1=data_df.groupby(["Name","Maths"])[["Science"]].sum().unstack()
data_df1

       Science
Maths       66    74    78    81    87    90    92
Name
Aman       NaN   NaN   NaN   NaN  82.0   NaN   NaN
Bhavna     NaN   NaN  69.0   NaN   NaN   NaN   NaN
Chirag     NaN   NaN   NaN   NaN   NaN  85.0   NaN
Divya     70.0   NaN   NaN   NaN   NaN   NaN   NaN
Eshan      NaN   NaN   NaN   NaN   NaN   NaN  89.0
Fatima     NaN   NaN   NaN  76.0   NaN   NaN   NaN
Gaurav     NaN  80.0   NaN   NaN   NaN   NaN   NaN

In [13]:
data_df1=data_df.groupby(["Name","Maths"])[["Science"]].max().unstack()
data_df1

       Science
Maths       66    74    78    81    87    90    92
Name
Aman       NaN   NaN   NaN   NaN  82.0   NaN   NaN
Bhavna     NaN   NaN  69.0   NaN   NaN   NaN   NaN
Chirag     NaN   NaN   NaN   NaN   NaN  85.0   NaN
Divya     70.0   NaN   NaN   NaN   NaN   NaN   NaN
Eshan      NaN   NaN   NaN   NaN   NaN   NaN  89.0
Fatima     NaN   NaN   NaN  76.0   NaN   NaN   NaN
Gaurav     NaN  80.0   NaN   NaN   NaN   NaN   NaN

In [14]:
data_df

   Student_ID    Name  Maths  Science  English  Attendance(%)
0         101    Aman     87       82       75             95
1         102  Bhavna     78       69       88             88
2         103  Chirag     90       85       79             90
3         104   Divya     66       70       91             92
4         105   Eshan     92       89       73             85
5         106  Fatima     81       76       85             93
6         107  Gaurav     74       80       68             87

In [17]:
new_data=data_df.groupby("Name").agg(Maths_n=("Maths","sum"),English_n=("English","mean"),Science_n=("Science","count"))
new_data

        Maths_n  English_n  Science_n
Name
Aman         87       75.0          1
Bhavna       78       88.0          1
Chirag       90       79.0          1
Divya        66       91.0          1
Eshan        92       73.0          1
Fatima       81       85.0          1
Gaurav       74       68.0          1

In [32]:
import pandas as pd
import os
os.getcwd()

'C:\\Users\\talib\\Downloads'

In [33]:
import pandas as pd
import os
os.getcwd()

'C:\\Users\\talib\\Downloads'

In [38]:
desktop="C:\\Users\\talib\\OneDrive\\Desktop"
os.chdir(desktop)

In [39]:
os.getcwd()

'C:\\Users\\talib\\OneDrive\\Desktop'

In [41]:
download="C:\\Users\\talib\\Downloads"
os.chdir(download)

In [42]:
os.getcwd()

'C:\\Users\\talib\\Downloads'

In [ ]:
"C:\Users\talib\Downloads\sales_transactions_50.csv"

In [45]:
import pandas as pd
import os
os.getcwd()

'C:\\Users\\talib\\Downloads'

In [47]:
list_dirctory=os.listdir()
for file in list_dirctory:
    if file.endswith(".csv"):
        print(file)

cricket_details.csv
kirana_shopping_data.csv
new_transactions.csv
pandas_large_practice_data.csv
pandas_practice_data.csv
Research Hub Papers - May 23, 2025.csv
sales_transactions_50.csv
shop_details.csv
staff_details.csv
Students_details.csv
student_marks.csv

In [54]:
list_dirctory=os.listdir()
df=None
for file in list_dirctory:
    if file.endswith(".csv") and file.startswith("staff"):
        df=pd.read_csv(file)
directory="C:\\Users\\talib\\Desktop"
df.to_json("C:\\Users\\talib\\OneDrive\\Desktop\\data_df.json",orient="records")

In [51]:
os.getcwd()

'C:\\Users\\talib\\Downloads'

In [61]:
import pandas as pd
import os
df=None
os.getcwd()
get_list_directory=os.listdir()
for file in get_list_directory:
    if file.endswith(".csv") and file.startswith("sales"):
        df1=pd.read_csv(file)
dirc="C:\\Users\\talib\\OneDrive\\Desktop"
os.chdir(dirc)
os.getcwd()
df1.to_excel("sales_transaction.xlsx")

In [14]:
import pandas as pd
import os
os.getcwd()
change_dir="C:\\Users\\talib\\Downloads"
os.chdir(change_dir)
df3=None
for file in os.listdir():
    filename,ext=os.path.splitext(file)
    if ext==".csv":
       df3=pd.read_csv(file)
       #print(df3)
       break
directory2="C:\\Users\\talib\\OneDrive\\Desktop"
os.chdir(directory2)
df3.to_json("cricket.json",orient="records",index=False)

In [62]:
import pandas as pd 
import os
os.getcwd()

'C:\\Users\\talib\\OneDrive\\Desktop'

In [65]:
os.chdir("...")

In [66]:
os.getcwd()

'C:\\Users\\talib\\OneDrive'

In [67]:
os.chdir("..")

In [68]:
os.getcwd()

'C:\\Users\\talib'

In [69]:
os.chdir("Downloads")

In [70]:
os.getcwd()

'C:\\Users\\talib\\Downloads'

In [72]:
for file in os.listdir():
    if file.endswith(".csv") and file.startswith("new"):
        print(file)

new_transactions.csv

In [73]:
df2=None
for file in os.listdir():
    if file.endswith(".csv") and file.startswith("new"):
        df2=pd.read_csv(file)
ch_dir="C:\\Users\\talib\\OneDrive\\Desktop"
os.chdir(ch_dir)
df2.to_json("new_transaction.json",orient="records")

## NEW FILES

In [19]:
import pandas as pd
import os
os.getcwd()
df1=None
directory="C:\\Users\\talib\\Downloads"
os.chdir(directory)
for file in os.listdir():
    if file.endswith(".csv") and file.startswith("sample"):
        df1=pd.read_csv(file)
dir1="C:\\Users\\talib\\OneDrive\\Desktop"
os.chdir(dir1)
df1.to_json("csv to json file.json",orient="records",index=False)

In [22]:
import pandas as pd
import os
os.getcwd()
df2=None
directory="C:\\Users\\talib\\Downloads"
os.chdir(directory)
for file in os.listdir():
    filename,ext=os.path.splitext(file)
    if ext.lower()==".csv":
        df2=pd.read_csv(file)
        break
dir1="C:\\Users\\talib\\OneDrive\\Desktop"
os.chdir(dir1)
df2.to_excel("csv to excel by another method.xlsx",index=False)

In [26]:
import pandas as pd
import os
os.getcwd()
directory="C:\\Users\\talib\\Downloads"
os.chdir(directory)
df3=None
for file in os.listdir():
    if file.endswith(".xlsx") and file.startswith("FINAL"):
        df3=pd.read_excel(file)
dir1="C:\\Users\\talib\\OneDrive\\Desktop"
os.chdir(dir1)     
df3.to_csv(" final450 excel to csv.csv",index=False)